{
	"nodes":[
		{"op":"null","name":"Input","inputs":[]},
		{"op":"null","name":"seq_1466040848","inputs":[]},
		{"op":"identity","name":"seq_1466040848$0","inputs":[[1,0,0]]},
		{"op":"null","name":"4.State","inputs":[]},
		{"op":"reshape","name":"1.1.1.attention.1$0","attrs":{"shape":"(-3, -2)"},"inputs":[[0,0,0]]},
		{"op":"null","name":"1.1.1.attention.1.Net.Weights","inputs":[]},
		{"op":"null","name":"1.1.1.attention.1.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.1.1.attention.1.Net$0","attrs":{"num_hidden":"768"},"inputs":[[4,0,0],[5,0,0],[6,0,0]]},
		{"op":"reshape","name":"1.1.1.attention.1.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[7,0,0]]},
		{"op":"reshape_like","name":"1.1.1.attention.1$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[8,0,0],[0,0,0]]},
		{"op":"null","name":"1.1.1.attention.2.Net.Weights","inputs":[]},
		{"op":"null","name":"1.1.1.attention.2.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.1.1.attention.2.Net$0","attrs":{"num_hidden":"768"},"inputs":[[4,0,0],[10,0,0],[11,0,0]]},
		{"op":"reshape","name":"1.1.1.attention.2.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[12,0,0]]},
		{"op":"reshape_like","name":"1.1.1.attention.2$0","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[13,0,0],[0,0,0]]},
		{"op":"_MulScalar","name":"1.1.1.attention.3$0","attrs":{"scalar":"0.125"},"inputs":[[14,0,0]]},
		{"op":"null","name":"1.1.1.attention.4.Net.Weights","inputs":[]},
		{"op":"null","name":"1.1.1.attention.4.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.1.1.attention.4.Net$0","attrs":{"num_hidden":"768"},"inputs":[[4,0,0],[16,0,0],[17,0,0]]},
		{"op":"reshape","name":"1.1.1.attention.4.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[18,0,0]]},
		{"op":"reshape_like","name":"1.1.1.attention.4$0","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[19,0,0],[0,0,0]]},
		{"op":"SwapAxis","name":"1.1.1.attention.5$0","attrs":{"dim1":"1","dim2":"2"},"inputs":[[20,0,0]]},
		{"op":"reshape","name":"1.1.1.attention.5$1","attrs":{"shape":"(-3, -2)"},"inputs":[[21,0,0]]},
		{"op":"SwapAxis","name":"1.1.1.attention.5$2","attrs":{"dim1":"1","dim2":"2"},"inputs":[[9,0,0]]},
		{"op":"reshape","name":"1.1.1.attention.5$3","attrs":{"shape":"(-3, -2)"},"inputs":[[23,0,0]]},
		{"op":"SwapAxis","name":"1.1.1.attention.5$4","attrs":{"dim1":"1","dim2":"2"},"inputs":[[15,0,0]]},
		{"op":"reshape","name":"1.1.1.attention.5$5","attrs":{"shape":"(-3, -2)"},"inputs":[[25,0,0]]},
		{"op":"expand_dims","name":"1.1.1.attention.5$6","attrs":{"axis":"1"},"inputs":[[1,0,0]]},
		{"op":"broadcast_like","name":"1.1.1.attention.5$7","attrs":{"lhs_axes":"(1)","rhs_axes":"(1)"},"inputs":[[27,0,0],[23,0,0]]},
		{"op":"reshape","name":"1.1.1.attention.5$8","attrs":{"shape":"(-1)"},"inputs":[[28,0,0]]},
		{"op":"batch_dot","name":"1.1.1.attention.5$9","attrs":{"transpose_a":"false","transpose_b":"true"},"inputs":[[26,0,0],[24,0,0]]},
		{"op":"SwapAxis","name":"1.1.1.attention.5$10","attrs":{"dim1":"1","dim2":"2"},"inputs":[[30,0,0]]},
		{"op":"SequenceMask","name":"1.1.1.attention.5$11","attrs":{"use_sequence_length":"true","value":"-1e37","axis":"1"},"inputs":[[31,0,0],[29,0,0]]},
		{"op":"SwapAxis","name":"1.1.1.attention.5$12","attrs":{"dim1":"1","dim2":"2"},"inputs":[[32,0,0]]},
		{"op":"softmax","name":"1.1.1.attention.5$13","attrs":{"axis":"-1"},"inputs":[[33,0,0]]},
		{"op":"batch_dot","name":"1.1.1.attention.5$14","attrs":{"transpose_a":"false","transpose_b":"false"},"inputs":[[34,0,0],[22,0,0]]},
		{"op":"reshape_like","name":"1.1.1.attention.5$15","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[35,0,0],[25,0,0]]},
		{"op":"SwapAxis","name":"1.1.1.attention.5$16","attrs":{"dim1":"1","dim2":"2"},"inputs":[[36,0,0]]},
		{"op":"reshape","name":"1.1.1.attention.6$0","attrs":{"shape":"(-3, -2)"},"inputs":[[37,0,0]]},
		{"op":"null","name":"1.1.1.attention.6.Net.Weights","inputs":[]},
		{"op":"null","name":"1.1.1.attention.6.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.1.1.attention.6.Net","attrs":{"num_hidden":"768","no_bias":"False"},"inputs":[[38,0,0],[39,0,0],[40,0,0]]},
		{"op":"reshape_like","name":"1.1.1.attention.6$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[41,0,0],[37,0,0]]},
		{"op":"Dropout","name":"1.1.1.dropout$0","attrs":{"p":"0.1","mode":"always","axes":"()"},"inputs":[[42,0,0]]},
		{"op":"_Plus","name":"1.1.1.add$0","inputs":[[0,0,0],[43,0,0]]},
		{"op":"null","name":"1.1.1.norm.Scaling","inputs":[]},
		{"op":"null","name":"1.1.1.norm.Biases","inputs":[]},
		{"op":"sum_axis","name":"1.1.1.norm$0","attrs":{"axis":"(2)"},"inputs":[[44,0,0]]},
		{"op":"_DivScalar","name":"1.1.1.norm$1","attrs":{"scalar":"768."},"inputs":[[47,0,0]]},
		{"op":"reshape","name":"1.1.1.norm$2","attrs":{"shape":"(0, -1, 1)"},"inputs":[[48,0,0]]},
		{"op":"broadcast_minus","name":"1.1.1.norm$3","inputs":[[44,0,0],[49,0,0]]},
		{"op":"square","name":"1.1.1.norm$4","inputs":[[50,0,0]]},
		{"op":"sum_axis","name":"1.1.1.norm$5","attrs":{"axis":"(2)"},"inputs":[[51,0,0]]},
		{"op":"_DivScalar","name":"1.1.1.norm$6","attrs":{"scalar":"768."},"inputs":[[52,0,0]]},
		{"op":"_PlusScalar","name":"1.1.1.norm$7","attrs":{"scalar":"1.e-12"},"inputs":[[53,0,0]]},
		{"op":"sqrt","name":"1.1.1.norm$8","inputs":[[54,0,0]]},
		{"op":"reshape","name":"1.1.1.norm$9","attrs":{"shape":"(0, -1, 1)"},"inputs":[[55,0,0]]},
		{"op":"broadcast_div","name":"1.1.1.norm$10","inputs":[[50,0,0],[56,0,0]]},
		{"op":"reshape","name":"1.1.1.norm$11","attrs":{"shape":"(1, 1, 768)"},"inputs":[[45,0,0]]},
		{"op":"broadcast_mul","name":"1.1.1.norm$12","inputs":[[57,0,0],[58,0,0]]},
		{"op":"reshape","name":"1.1.1.norm$13","attrs":{"shape":"(1, 1, 768)"},"inputs":[[46,0,0]]},
		{"op":"broadcast_add","name":"1.1.1.norm$14","inputs":[[59,0,0],[60,0,0]]},
		{"op":"reshape","name":"1.1.2.linear1$0","attrs":{"shape":"(-3, -2)"},"inputs":[[61,0,0]]},
		{"op":"null","name":"1.1.2.linear1.Net.Weights","inputs":[]},
		{"op":"null","name":"1.1.2.linear1.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.1.2.linear1.Net","attrs":{"num_hidden":"3072","no_bias":"False"},"inputs":[[62,0,0],[63,0,0],[64,0,0]]},
		{"op":"reshape_like","name":"1.1.2.linear1$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[65,0,0],[61,0,0]]},
		{"op":"_PowerScalar","name":"1.1.2.gelu$0","attrs":{"scalar":"3."},"inputs":[[66,0,0]]},
		{"op":"_MulScalar","name":"1.1.2.gelu$1","attrs":{"scalar":"0.044715"},"inputs":[[67,0,0]]},
		{"op":"_Plus","name":"1.1.2.gelu$2","inputs":[[66,0,0],[68,0,0]]},
		{"op":"_MulScalar","name":"1.1.2.gelu$3","attrs":{"scalar":"0.7978845608028654"},"inputs":[[69,0,0]]},
		{"op":"tanh","name":"1.1.2.gelu$4","inputs":[[70,0,0]]},
		{"op":"_PlusScalar","name":"1.1.2.gelu$5","attrs":{"scalar":"1.0"},"inputs":[[71,0,0]]},
		{"op":"_MulScalar","name":"1.1.2.gelu$6","attrs":{"scalar":"0.5"},"inputs":[[66,0,0]]},
		{"op":"_Mul","name":"1.1.2.gelu$7","inputs":[[73,0,0],[72,0,0]]},
		{"op":"reshape","name":"1.1.2.linear2$0","attrs":{"shape":"(-3, -2)"},"inputs":[[74,0,0]]},
		{"op":"null","name":"1.1.2.linear2.Net.Weights","inputs":[]},
		{"op":"null","name":"1.1.2.linear2.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.1.2.linear2.Net","attrs":{"num_hidden":"768","no_bias":"False"},"inputs":[[75,0,0],[76,0,0],[77,0,0]]},
		{"op":"reshape_like","name":"1.1.2.linear2$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[78,0,0],[74,0,0]]},
		{"op":"Dropout","name":"1.1.2.dropout$0","attrs":{"p":"0.1","mode":"always","axes":"()"},"inputs":[[79,0,0]]},
		{"op":"_Plus","name":"1.1.2.add$0","inputs":[[61,0,0],[80,0,0]]},
		{"op":"null","name":"1.1.2.norm.Scaling","inputs":[]},
		{"op":"null","name":"1.1.2.norm.Biases","inputs":[]},
		{"op":"sum_axis","name":"1.1.2.norm$0","attrs":{"axis":"(2)"},"inputs":[[81,0,0]]},
		{"op":"_DivScalar","name":"1.1.2.norm$1","attrs":{"scalar":"768."},"inputs":[[84,0,0]]},
		{"op":"reshape","name":"1.1.2.norm$2","attrs":{"shape":"(0, -1, 1)"},"inputs":[[85,0,0]]},
		{"op":"broadcast_minus","name":"1.1.2.norm$3","inputs":[[81,0,0],[86,0,0]]},
		{"op":"square","name":"1.1.2.norm$4","inputs":[[87,0,0]]},
		{"op":"sum_axis","name":"1.1.2.norm$5","attrs":{"axis":"(2)"},"inputs":[[88,0,0]]},
		{"op":"_DivScalar","name":"1.1.2.norm$6","attrs":{"scalar":"768."},"inputs":[[89,0,0]]},
		{"op":"_PlusScalar","name":"1.1.2.norm$7","attrs":{"scalar":"1.e-12"},"inputs":[[90,0,0]]},
		{"op":"sqrt","name":"1.1.2.norm$8","inputs":[[91,0,0]]},
		{"op":"reshape","name":"1.1.2.norm$9","attrs":{"shape":"(0, -1, 1)"},"inputs":[[92,0,0]]},
		{"op":"broadcast_div","name":"1.1.2.norm$10","inputs":[[87,0,0],[93,0,0]]},
		{"op":"reshape","name":"1.1.2.norm$11","attrs":{"shape":"(1, 1, 768)"},"inputs":[[82,0,0]]},
		{"op":"broadcast_mul","name":"1.1.2.norm$12","inputs":[[94,0,0],[95,0,0]]},
		{"op":"reshape","name":"1.1.2.norm$13","attrs":{"shape":"(1, 1, 768)"},"inputs":[[83,0,0]]},
		{"op":"broadcast_add","name":"1.1.2.norm$14","inputs":[[96,0,0],[97,0,0]]},
		{"op":"reshape","name":"1.2.1.attention.1$0","attrs":{"shape":"(-3, -2)"},"inputs":[[98,0,0]]},
		{"op":"null","name":"1.2.1.attention.1.Net.Weights","inputs":[]},
		{"op":"null","name":"1.2.1.attention.1.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.2.1.attention.1.Net$0","attrs":{"num_hidden":"768"},"inputs":[[99,0,0],[100,0,0],[101,0,0]]},
		{"op":"reshape","name":"1.2.1.attention.1.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[102,0,0]]},
		{"op":"reshape_like","name":"1.2.1.attention.1$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[103,0,0],[98,0,0]]},
		{"op":"null","name":"1.2.1.attention.2.Net.Weights","inputs":[]},
		{"op":"null","name":"1.2.1.attention.2.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.2.1.attention.2.Net$0","attrs":{"num_hidden":"768"},"inputs":[[99,0,0],[105,0,0],[106,0,0]]},
		{"op":"reshape","name":"1.2.1.attention.2.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[107,0,0]]},
		{"op":"reshape_like","name":"1.2.1.attention.2$0","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[108,0,0],[98,0,0]]},
		{"op":"_MulScalar","name":"1.2.1.attention.3$0","attrs":{"scalar":"0.125"},"inputs":[[109,0,0]]},
		{"op":"null","name":"1.2.1.attention.4.Net.Weights","inputs":[]},
		{"op":"null","name":"1.2.1.attention.4.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.2.1.attention.4.Net$0","attrs":{"num_hidden":"768"},"inputs":[[99,0,0],[111,0,0],[112,0,0]]},
		{"op":"reshape","name":"1.2.1.attention.4.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[113,0,0]]},
		{"op":"reshape_like","name":"1.2.1.attention.4$0","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[114,0,0],[98,0,0]]},
		{"op":"SwapAxis","name":"1.2.1.attention.5$0","attrs":{"dim1":"1","dim2":"2"},"inputs":[[115,0,0]]},
		{"op":"reshape","name":"1.2.1.attention.5$1","attrs":{"shape":"(-3, -2)"},"inputs":[[116,0,0]]},
		{"op":"SwapAxis","name":"1.2.1.attention.5$2","attrs":{"dim1":"1","dim2":"2"},"inputs":[[104,0,0]]},
		{"op":"reshape","name":"1.2.1.attention.5$3","attrs":{"shape":"(-3, -2)"},"inputs":[[118,0,0]]},
		{"op":"SwapAxis","name":"1.2.1.attention.5$4","attrs":{"dim1":"1","dim2":"2"},"inputs":[[110,0,0]]},
		{"op":"reshape","name":"1.2.1.attention.5$5","attrs":{"shape":"(-3, -2)"},"inputs":[[120,0,0]]},
		{"op":"expand_dims","name":"1.2.1.attention.5$6","attrs":{"axis":"1"},"inputs":[[1,0,0]]},
		{"op":"broadcast_like","name":"1.2.1.attention.5$7","attrs":{"lhs_axes":"(1)","rhs_axes":"(1)"},"inputs":[[122,0,0],[118,0,0]]},
		{"op":"reshape","name":"1.2.1.attention.5$8","attrs":{"shape":"(-1)"},"inputs":[[123,0,0]]},
		{"op":"batch_dot","name":"1.2.1.attention.5$9","attrs":{"transpose_a":"false","transpose_b":"true"},"inputs":[[121,0,0],[119,0,0]]},
		{"op":"SwapAxis","name":"1.2.1.attention.5$10","attrs":{"dim1":"1","dim2":"2"},"inputs":[[125,0,0]]},
		{"op":"SequenceMask","name":"1.2.1.attention.5$11","attrs":{"use_sequence_length":"true","value":"-1e37","axis":"1"},"inputs":[[126,0,0],[124,0,0]]},
		{"op":"SwapAxis","name":"1.2.1.attention.5$12","attrs":{"dim1":"1","dim2":"2"},"inputs":[[127,0,0]]},
		{"op":"softmax","name":"1.2.1.attention.5$13","attrs":{"axis":"-1"},"inputs":[[128,0,0]]},
		{"op":"batch_dot","name":"1.2.1.attention.5$14","attrs":{"transpose_a":"false","transpose_b":"false"},"inputs":[[129,0,0],[117,0,0]]},
		{"op":"reshape_like","name":"1.2.1.attention.5$15","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[130,0,0],[120,0,0]]},
		{"op":"SwapAxis","name":"1.2.1.attention.5$16","attrs":{"dim1":"1","dim2":"2"},"inputs":[[131,0,0]]},
		{"op":"reshape","name":"1.2.1.attention.6$0","attrs":{"shape":"(-3, -2)"},"inputs":[[132,0,0]]},
		{"op":"null","name":"1.2.1.attention.6.Net.Weights","inputs":[]},
		{"op":"null","name":"1.2.1.attention.6.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.2.1.attention.6.Net","attrs":{"num_hidden":"768","no_bias":"False"},"inputs":[[133,0,0],[134,0,0],[135,0,0]]},
		{"op":"reshape_like","name":"1.2.1.attention.6$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[136,0,0],[132,0,0]]},
		{"op":"Dropout","name":"1.2.1.dropout$0","attrs":{"p":"0.1","mode":"always","axes":"()"},"inputs":[[137,0,0]]},
		{"op":"_Plus","name":"1.2.1.add$0","inputs":[[98,0,0],[138,0,0]]},
		{"op":"null","name":"1.2.1.norm.Scaling","inputs":[]},
		{"op":"null","name":"1.2.1.norm.Biases","inputs":[]},
		{"op":"sum_axis","name":"1.2.1.norm$0","attrs":{"axis":"(2)"},"inputs":[[139,0,0]]},
		{"op":"_DivScalar","name":"1.2.1.norm$1","attrs":{"scalar":"768."},"inputs":[[142,0,0]]},
		{"op":"reshape","name":"1.2.1.norm$2","attrs":{"shape":"(0, -1, 1)"},"inputs":[[143,0,0]]},
		{"op":"broadcast_minus","name":"1.2.1.norm$3","inputs":[[139,0,0],[144,0,0]]},
		{"op":"square","name":"1.2.1.norm$4","inputs":[[145,0,0]]},
		{"op":"sum_axis","name":"1.2.1.norm$5","attrs":{"axis":"(2)"},"inputs":[[146,0,0]]},
		{"op":"_DivScalar","name":"1.2.1.norm$6","attrs":{"scalar":"768."},"inputs":[[147,0,0]]},
		{"op":"_PlusScalar","name":"1.2.1.norm$7","attrs":{"scalar":"1.e-12"},"inputs":[[148,0,0]]},
		{"op":"sqrt","name":"1.2.1.norm$8","inputs":[[149,0,0]]},
		{"op":"reshape","name":"1.2.1.norm$9","attrs":{"shape":"(0, -1, 1)"},"inputs":[[150,0,0]]},
		{"op":"broadcast_div","name":"1.2.1.norm$10","inputs":[[145,0,0],[151,0,0]]},
		{"op":"reshape","name":"1.2.1.norm$11","attrs":{"shape":"(1, 1, 768)"},"inputs":[[140,0,0]]},
		{"op":"broadcast_mul","name":"1.2.1.norm$12","inputs":[[152,0,0],[153,0,0]]},
		{"op":"reshape","name":"1.2.1.norm$13","attrs":{"shape":"(1, 1, 768)"},"inputs":[[141,0,0]]},
		{"op":"broadcast_add","name":"1.2.1.norm$14","inputs":[[154,0,0],[155,0,0]]},
		{"op":"reshape","name":"1.2.2.linear1$0","attrs":{"shape":"(-3, -2)"},"inputs":[[156,0,0]]},
		{"op":"null","name":"1.2.2.linear1.Net.Weights","inputs":[]},
		{"op":"null","name":"1.2.2.linear1.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.2.2.linear1.Net","attrs":{"num_hidden":"3072","no_bias":"False"},"inputs":[[157,0,0],[158,0,0],[159,0,0]]},
		{"op":"reshape_like","name":"1.2.2.linear1$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[160,0,0],[156,0,0]]},
		{"op":"_PowerScalar","name":"1.2.2.gelu$0","attrs":{"scalar":"3."},"inputs":[[161,0,0]]},
		{"op":"_MulScalar","name":"1.2.2.gelu$1","attrs":{"scalar":"0.044715"},"inputs":[[162,0,0]]},
		{"op":"_Plus","name":"1.2.2.gelu$2","inputs":[[161,0,0],[163,0,0]]},
		{"op":"_MulScalar","name":"1.2.2.gelu$3","attrs":{"scalar":"0.7978845608028654"},"inputs":[[164,0,0]]},
		{"op":"tanh","name":"1.2.2.gelu$4","inputs":[[165,0,0]]},
		{"op":"_PlusScalar","name":"1.2.2.gelu$5","attrs":{"scalar":"1.0"},"inputs":[[166,0,0]]},
		{"op":"_MulScalar","name":"1.2.2.gelu$6","attrs":{"scalar":"0.5"},"inputs":[[161,0,0]]},
		{"op":"_Mul","name":"1.2.2.gelu$7","inputs":[[168,0,0],[167,0,0]]},
		{"op":"reshape","name":"1.2.2.linear2$0","attrs":{"shape":"(-3, -2)"},"inputs":[[169,0,0]]},
		{"op":"null","name":"1.2.2.linear2.Net.Weights","inputs":[]},
		{"op":"null","name":"1.2.2.linear2.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.2.2.linear2.Net","attrs":{"num_hidden":"768","no_bias":"False"},"inputs":[[170,0,0],[171,0,0],[172,0,0]]},
		{"op":"reshape_like","name":"1.2.2.linear2$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[173,0,0],[169,0,0]]},
		{"op":"Dropout","name":"1.2.2.dropout$0","attrs":{"p":"0.1","mode":"always","axes":"()"},"inputs":[[174,0,0]]},
		{"op":"_Plus","name":"1.2.2.add$0","inputs":[[156,0,0],[175,0,0]]},
		{"op":"null","name":"1.2.2.norm.Scaling","inputs":[]},
		{"op":"null","name":"1.2.2.norm.Biases","inputs":[]},
		{"op":"sum_axis","name":"1.2.2.norm$0","attrs":{"axis":"(2)"},"inputs":[[176,0,0]]},
		{"op":"_DivScalar","name":"1.2.2.norm$1","attrs":{"scalar":"768."},"inputs":[[179,0,0]]},
		{"op":"reshape","name":"1.2.2.norm$2","attrs":{"shape":"(0, -1, 1)"},"inputs":[[180,0,0]]},
		{"op":"broadcast_minus","name":"1.2.2.norm$3","inputs":[[176,0,0],[181,0,0]]},
		{"op":"square","name":"1.2.2.norm$4","inputs":[[182,0,0]]},
		{"op":"sum_axis","name":"1.2.2.norm$5","attrs":{"axis":"(2)"},"inputs":[[183,0,0]]},
		{"op":"_DivScalar","name":"1.2.2.norm$6","attrs":{"scalar":"768."},"inputs":[[184,0,0]]},
		{"op":"_PlusScalar","name":"1.2.2.norm$7","attrs":{"scalar":"1.e-12"},"inputs":[[185,0,0]]},
		{"op":"sqrt","name":"1.2.2.norm$8","inputs":[[186,0,0]]},
		{"op":"reshape","name":"1.2.2.norm$9","attrs":{"shape":"(0, -1, 1)"},"inputs":[[187,0,0]]},
		{"op":"broadcast_div","name":"1.2.2.norm$10","inputs":[[182,0,0],[188,0,0]]},
		{"op":"reshape","name":"1.2.2.norm$11","attrs":{"shape":"(1, 1, 768)"},"inputs":[[177,0,0]]},
		{"op":"broadcast_mul","name":"1.2.2.norm$12","inputs":[[189,0,0],[190,0,0]]},
		{"op":"reshape","name":"1.2.2.norm$13","attrs":{"shape":"(1, 1, 768)"},"inputs":[[178,0,0]]},
		{"op":"broadcast_add","name":"1.2.2.norm$14","inputs":[[191,0,0],[192,0,0]]},
		{"op":"reshape","name":"1.3.1.attention.1$0","attrs":{"shape":"(-3, -2)"},"inputs":[[193,0,0]]},
		{"op":"null","name":"1.3.1.attention.1.Net.Weights","inputs":[]},
		{"op":"null","name":"1.3.1.attention.1.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.3.1.attention.1.Net$0","attrs":{"num_hidden":"768"},"inputs":[[194,0,0],[195,0,0],[196,0,0]]},
		{"op":"reshape","name":"1.3.1.attention.1.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[197,0,0]]},
		{"op":"reshape_like","name":"1.3.1.attention.1$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[198,0,0],[193,0,0]]},
		{"op":"null","name":"1.3.1.attention.2.Net.Weights","inputs":[]},
		{"op":"null","name":"1.3.1.attention.2.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.3.1.attention.2.Net$0","attrs":{"num_hidden":"768"},"inputs":[[194,0,0],[200,0,0],[201,0,0]]},
		{"op":"reshape","name":"1.3.1.attention.2.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[202,0,0]]},
		{"op":"reshape_like","name":"1.3.1.attention.2$0","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[203,0,0],[193,0,0]]},
		{"op":"_MulScalar","name":"1.3.1.attention.3$0","attrs":{"scalar":"0.125"},"inputs":[[204,0,0]]},
		{"op":"null","name":"1.3.1.attention.4.Net.Weights","inputs":[]},
		{"op":"null","name":"1.3.1.attention.4.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.3.1.attention.4.Net$0","attrs":{"num_hidden":"768"},"inputs":[[194,0,0],[206,0,0],[207,0,0]]},
		{"op":"reshape","name":"1.3.1.attention.4.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[208,0,0]]},
		{"op":"reshape_like","name":"1.3.1.attention.4$0","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[209,0,0],[193,0,0]]},
		{"op":"SwapAxis","name":"1.3.1.attention.5$0","attrs":{"dim1":"1","dim2":"2"},"inputs":[[210,0,0]]},
		{"op":"reshape","name":"1.3.1.attention.5$1","attrs":{"shape":"(-3, -2)"},"inputs":[[211,0,0]]},
		{"op":"SwapAxis","name":"1.3.1.attention.5$2","attrs":{"dim1":"1","dim2":"2"},"inputs":[[199,0,0]]},
		{"op":"reshape","name":"1.3.1.attention.5$3","attrs":{"shape":"(-3, -2)"},"inputs":[[213,0,0]]},
		{"op":"SwapAxis","name":"1.3.1.attention.5$4","attrs":{"dim1":"1","dim2":"2"},"inputs":[[205,0,0]]},
		{"op":"reshape","name":"1.3.1.attention.5$5","attrs":{"shape":"(-3, -2)"},"inputs":[[215,0,0]]},
		{"op":"expand_dims","name":"1.3.1.attention.5$6","attrs":{"axis":"1"},"inputs":[[1,0,0]]},
		{"op":"broadcast_like","name":"1.3.1.attention.5$7","attrs":{"lhs_axes":"(1)","rhs_axes":"(1)"},"inputs":[[217,0,0],[213,0,0]]},
		{"op":"reshape","name":"1.3.1.attention.5$8","attrs":{"shape":"(-1)"},"inputs":[[218,0,0]]},
		{"op":"batch_dot","name":"1.3.1.attention.5$9","attrs":{"transpose_a":"false","transpose_b":"true"},"inputs":[[216,0,0],[214,0,0]]},
		{"op":"SwapAxis","name":"1.3.1.attention.5$10","attrs":{"dim1":"1","dim2":"2"},"inputs":[[220,0,0]]},
		{"op":"SequenceMask","name":"1.3.1.attention.5$11","attrs":{"use_sequence_length":"true","value":"-1e37","axis":"1"},"inputs":[[221,0,0],[219,0,0]]},
		{"op":"SwapAxis","name":"1.3.1.attention.5$12","attrs":{"dim1":"1","dim2":"2"},"inputs":[[222,0,0]]},
		{"op":"softmax","name":"1.3.1.attention.5$13","attrs":{"axis":"-1"},"inputs":[[223,0,0]]},
		{"op":"batch_dot","name":"1.3.1.attention.5$14","attrs":{"transpose_a":"false","transpose_b":"false"},"inputs":[[224,0,0],[212,0,0]]},
		{"op":"reshape_like","name":"1.3.1.attention.5$15","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[225,0,0],[215,0,0]]},
		{"op":"SwapAxis","name":"1.3.1.attention.5$16","attrs":{"dim1":"1","dim2":"2"},"inputs":[[226,0,0]]},
		{"op":"reshape","name":"1.3.1.attention.6$0","attrs":{"shape":"(-3, -2)"},"inputs":[[227,0,0]]},
		{"op":"null","name":"1.3.1.attention.6.Net.Weights","inputs":[]},
		{"op":"null","name":"1.3.1.attention.6.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.3.1.attention.6.Net","attrs":{"num_hidden":"768","no_bias":"False"},"inputs":[[228,0,0],[229,0,0],[230,0,0]]},
		{"op":"reshape_like","name":"1.3.1.attention.6$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[231,0,0],[227,0,0]]},
		{"op":"Dropout","name":"1.3.1.dropout$0","attrs":{"p":"0.1","mode":"always","axes":"()"},"inputs":[[232,0,0]]},
		{"op":"_Plus","name":"1.3.1.add$0","inputs":[[193,0,0],[233,0,0]]},
		{"op":"null","name":"1.3.1.norm.Scaling","inputs":[]},
		{"op":"null","name":"1.3.1.norm.Biases","inputs":[]},
		{"op":"sum_axis","name":"1.3.1.norm$0","attrs":{"axis":"(2)"},"inputs":[[234,0,0]]},
		{"op":"_DivScalar","name":"1.3.1.norm$1","attrs":{"scalar":"768."},"inputs":[[237,0,0]]},
		{"op":"reshape","name":"1.3.1.norm$2","attrs":{"shape":"(0, -1, 1)"},"inputs":[[238,0,0]]},
		{"op":"broadcast_minus","name":"1.3.1.norm$3","inputs":[[234,0,0],[239,0,0]]},
		{"op":"square","name":"1.3.1.norm$4","inputs":[[240,0,0]]},
		{"op":"sum_axis","name":"1.3.1.norm$5","attrs":{"axis":"(2)"},"inputs":[[241,0,0]]},
		{"op":"_DivScalar","name":"1.3.1.norm$6","attrs":{"scalar":"768."},"inputs":[[242,0,0]]},
		{"op":"_PlusScalar","name":"1.3.1.norm$7","attrs":{"scalar":"1.e-12"},"inputs":[[243,0,0]]},
		{"op":"sqrt","name":"1.3.1.norm$8","inputs":[[244,0,0]]},
		{"op":"reshape","name":"1.3.1.norm$9","attrs":{"shape":"(0, -1, 1)"},"inputs":[[245,0,0]]},
		{"op":"broadcast_div","name":"1.3.1.norm$10","inputs":[[240,0,0],[246,0,0]]},
		{"op":"reshape","name":"1.3.1.norm$11","attrs":{"shape":"(1, 1, 768)"},"inputs":[[235,0,0]]},
		{"op":"broadcast_mul","name":"1.3.1.norm$12","inputs":[[247,0,0],[248,0,0]]},
		{"op":"reshape","name":"1.3.1.norm$13","attrs":{"shape":"(1, 1, 768)"},"inputs":[[236,0,0]]},
		{"op":"broadcast_add","name":"1.3.1.norm$14","inputs":[[249,0,0],[250,0,0]]},
		{"op":"reshape","name":"1.3.2.linear1$0","attrs":{"shape":"(-3, -2)"},"inputs":[[251,0,0]]},
		{"op":"null","name":"1.3.2.linear1.Net.Weights","inputs":[]},
		{"op":"null","name":"1.3.2.linear1.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.3.2.linear1.Net","attrs":{"num_hidden":"3072","no_bias":"False"},"inputs":[[252,0,0],[253,0,0],[254,0,0]]},
		{"op":"reshape_like","name":"1.3.2.linear1$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[255,0,0],[251,0,0]]},
		{"op":"_PowerScalar","name":"1.3.2.gelu$0","attrs":{"scalar":"3."},"inputs":[[256,0,0]]},
		{"op":"_MulScalar","name":"1.3.2.gelu$1","attrs":{"scalar":"0.044715"},"inputs":[[257,0,0]]},
		{"op":"_Plus","name":"1.3.2.gelu$2","inputs":[[256,0,0],[258,0,0]]},
		{"op":"_MulScalar","name":"1.3.2.gelu$3","attrs":{"scalar":"0.7978845608028654"},"inputs":[[259,0,0]]},
		{"op":"tanh","name":"1.3.2.gelu$4","inputs":[[260,0,0]]},
		{"op":"_PlusScalar","name":"1.3.2.gelu$5","attrs":{"scalar":"1.0"},"inputs":[[261,0,0]]},
		{"op":"_MulScalar","name":"1.3.2.gelu$6","attrs":{"scalar":"0.5"},"inputs":[[256,0,0]]},
		{"op":"_Mul","name":"1.3.2.gelu$7","inputs":[[263,0,0],[262,0,0]]},
		{"op":"reshape","name":"1.3.2.linear2$0","attrs":{"shape":"(-3, -2)"},"inputs":[[264,0,0]]},
		{"op":"null","name":"1.3.2.linear2.Net.Weights","inputs":[]},
		{"op":"null","name":"1.3.2.linear2.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.3.2.linear2.Net","attrs":{"num_hidden":"768","no_bias":"False"},"inputs":[[265,0,0],[266,0,0],[267,0,0]]},
		{"op":"reshape_like","name":"1.3.2.linear2$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[268,0,0],[264,0,0]]},
		{"op":"Dropout","name":"1.3.2.dropout$0","attrs":{"p":"0.1","mode":"always","axes":"()"},"inputs":[[269,0,0]]},
		{"op":"_Plus","name":"1.3.2.add$0","inputs":[[251,0,0],[270,0,0]]},
		{"op":"null","name":"1.3.2.norm.Scaling","inputs":[]},
		{"op":"null","name":"1.3.2.norm.Biases","inputs":[]},
		{"op":"sum_axis","name":"1.3.2.norm$0","attrs":{"axis":"(2)"},"inputs":[[271,0,0]]},
		{"op":"_DivScalar","name":"1.3.2.norm$1","attrs":{"scalar":"768."},"inputs":[[274,0,0]]},
		{"op":"reshape","name":"1.3.2.norm$2","attrs":{"shape":"(0, -1, 1)"},"inputs":[[275,0,0]]},
		{"op":"broadcast_minus","name":"1.3.2.norm$3","inputs":[[271,0,0],[276,0,0]]},
		{"op":"square","name":"1.3.2.norm$4","inputs":[[277,0,0]]},
		{"op":"sum_axis","name":"1.3.2.norm$5","attrs":{"axis":"(2)"},"inputs":[[278,0,0]]},
		{"op":"_DivScalar","name":"1.3.2.norm$6","attrs":{"scalar":"768."},"inputs":[[279,0,0]]},
		{"op":"_PlusScalar","name":"1.3.2.norm$7","attrs":{"scalar":"1.e-12"},"inputs":[[280,0,0]]},
		{"op":"sqrt","name":"1.3.2.norm$8","inputs":[[281,0,0]]},
		{"op":"reshape","name":"1.3.2.norm$9","attrs":{"shape":"(0, -1, 1)"},"inputs":[[282,0,0]]},
		{"op":"broadcast_div","name":"1.3.2.norm$10","inputs":[[277,0,0],[283,0,0]]},
		{"op":"reshape","name":"1.3.2.norm$11","attrs":{"shape":"(1, 1, 768)"},"inputs":[[272,0,0]]},
		{"op":"broadcast_mul","name":"1.3.2.norm$12","inputs":[[284,0,0],[285,0,0]]},
		{"op":"reshape","name":"1.3.2.norm$13","attrs":{"shape":"(1, 1, 768)"},"inputs":[[273,0,0]]},
		{"op":"broadcast_add","name":"1.3.2.norm$14","inputs":[[286,0,0],[287,0,0]]},
		{"op":"reshape","name":"1.4.1.attention.1$0","attrs":{"shape":"(-3, -2)"},"inputs":[[288,0,0]]},
		{"op":"null","name":"1.4.1.attention.1.Net.Weights","inputs":[]},
		{"op":"null","name":"1.4.1.attention.1.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.4.1.attention.1.Net$0","attrs":{"num_hidden":"768"},"inputs":[[289,0,0],[290,0,0],[291,0,0]]},
		{"op":"reshape","name":"1.4.1.attention.1.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[292,0,0]]},
		{"op":"reshape_like","name":"1.4.1.attention.1$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[293,0,0],[288,0,0]]},
		{"op":"null","name":"1.4.1.attention.2.Net.Weights","inputs":[]},
		{"op":"null","name":"1.4.1.attention.2.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.4.1.attention.2.Net$0","attrs":{"num_hidden":"768"},"inputs":[[289,0,0],[295,0,0],[296,0,0]]},
		{"op":"reshape","name":"1.4.1.attention.2.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[297,0,0]]},
		{"op":"reshape_like","name":"1.4.1.attention.2$0","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[298,0,0],[288,0,0]]},
		{"op":"_MulScalar","name":"1.4.1.attention.3$0","attrs":{"scalar":"0.125"},"inputs":[[299,0,0]]},
		{"op":"null","name":"1.4.1.attention.4.Net.Weights","inputs":[]},
		{"op":"null","name":"1.4.1.attention.4.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.4.1.attention.4.Net$0","attrs":{"num_hidden":"768"},"inputs":[[289,0,0],[301,0,0],[302,0,0]]},
		{"op":"reshape","name":"1.4.1.attention.4.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[303,0,0]]},
		{"op":"reshape_like","name":"1.4.1.attention.4$0","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[304,0,0],[288,0,0]]},
		{"op":"SwapAxis","name":"1.4.1.attention.5$0","attrs":{"dim1":"1","dim2":"2"},"inputs":[[305,0,0]]},
		{"op":"reshape","name":"1.4.1.attention.5$1","attrs":{"shape":"(-3, -2)"},"inputs":[[306,0,0]]},
		{"op":"SwapAxis","name":"1.4.1.attention.5$2","attrs":{"dim1":"1","dim2":"2"},"inputs":[[294,0,0]]},
		{"op":"reshape","name":"1.4.1.attention.5$3","attrs":{"shape":"(-3, -2)"},"inputs":[[308,0,0]]},
		{"op":"SwapAxis","name":"1.4.1.attention.5$4","attrs":{"dim1":"1","dim2":"2"},"inputs":[[300,0,0]]},
		{"op":"reshape","name":"1.4.1.attention.5$5","attrs":{"shape":"(-3, -2)"},"inputs":[[310,0,0]]},
		{"op":"expand_dims","name":"1.4.1.attention.5$6","attrs":{"axis":"1"},"inputs":[[1,0,0]]},
		{"op":"broadcast_like","name":"1.4.1.attention.5$7","attrs":{"lhs_axes":"(1)","rhs_axes":"(1)"},"inputs":[[312,0,0],[308,0,0]]},
		{"op":"reshape","name":"1.4.1.attention.5$8","attrs":{"shape":"(-1)"},"inputs":[[313,0,0]]},
		{"op":"batch_dot","name":"1.4.1.attention.5$9","attrs":{"transpose_a":"false","transpose_b":"true"},"inputs":[[311,0,0],[309,0,0]]},
		{"op":"SwapAxis","name":"1.4.1.attention.5$10","attrs":{"dim1":"1","dim2":"2"},"inputs":[[315,0,0]]},
		{"op":"SequenceMask","name":"1.4.1.attention.5$11","attrs":{"use_sequence_length":"true","value":"-1e37","axis":"1"},"inputs":[[316,0,0],[314,0,0]]},
		{"op":"SwapAxis","name":"1.4.1.attention.5$12","attrs":{"dim1":"1","dim2":"2"},"inputs":[[317,0,0]]},
		{"op":"softmax","name":"1.4.1.attention.5$13","attrs":{"axis":"-1"},"inputs":[[318,0,0]]},
		{"op":"batch_dot","name":"1.4.1.attention.5$14","attrs":{"transpose_a":"false","transpose_b":"false"},"inputs":[[319,0,0],[307,0,0]]},
		{"op":"reshape_like","name":"1.4.1.attention.5$15","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[320,0,0],[310,0,0]]},
		{"op":"SwapAxis","name":"1.4.1.attention.5$16","attrs":{"dim1":"1","dim2":"2"},"inputs":[[321,0,0]]},
		{"op":"reshape","name":"1.4.1.attention.6$0","attrs":{"shape":"(-3, -2)"},"inputs":[[322,0,0]]},
		{"op":"null","name":"1.4.1.attention.6.Net.Weights","inputs":[]},
		{"op":"null","name":"1.4.1.attention.6.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.4.1.attention.6.Net","attrs":{"num_hidden":"768","no_bias":"False"},"inputs":[[323,0,0],[324,0,0],[325,0,0]]},
		{"op":"reshape_like","name":"1.4.1.attention.6$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[326,0,0],[322,0,0]]},
		{"op":"Dropout","name":"1.4.1.dropout$0","attrs":{"p":"0.1","mode":"always","axes":"()"},"inputs":[[327,0,0]]},
		{"op":"_Plus","name":"1.4.1.add$0","inputs":[[288,0,0],[328,0,0]]},
		{"op":"null","name":"1.4.1.norm.Scaling","inputs":[]},
		{"op":"null","name":"1.4.1.norm.Biases","inputs":[]},
		{"op":"sum_axis","name":"1.4.1.norm$0","attrs":{"axis":"(2)"},"inputs":[[329,0,0]]},
		{"op":"_DivScalar","name":"1.4.1.norm$1","attrs":{"scalar":"768."},"inputs":[[332,0,0]]},
		{"op":"reshape","name":"1.4.1.norm$2","attrs":{"shape":"(0, -1, 1)"},"inputs":[[333,0,0]]},
		{"op":"broadcast_minus","name":"1.4.1.norm$3","inputs":[[329,0,0],[334,0,0]]},
		{"op":"square","name":"1.4.1.norm$4","inputs":[[335,0,0]]},
		{"op":"sum_axis","name":"1.4.1.norm$5","attrs":{"axis":"(2)"},"inputs":[[336,0,0]]},
		{"op":"_DivScalar","name":"1.4.1.norm$6","attrs":{"scalar":"768."},"inputs":[[337,0,0]]},
		{"op":"_PlusScalar","name":"1.4.1.norm$7","attrs":{"scalar":"1.e-12"},"inputs":[[338,0,0]]},
		{"op":"sqrt","name":"1.4.1.norm$8","inputs":[[339,0,0]]},
		{"op":"reshape","name":"1.4.1.norm$9","attrs":{"shape":"(0, -1, 1)"},"inputs":[[340,0,0]]},
		{"op":"broadcast_div","name":"1.4.1.norm$10","inputs":[[335,0,0],[341,0,0]]},
		{"op":"reshape","name":"1.4.1.norm$11","attrs":{"shape":"(1, 1, 768)"},"inputs":[[330,0,0]]},
		{"op":"broadcast_mul","name":"1.4.1.norm$12","inputs":[[342,0,0],[343,0,0]]},
		{"op":"reshape","name":"1.4.1.norm$13","attrs":{"shape":"(1, 1, 768)"},"inputs":[[331,0,0]]},
		{"op":"broadcast_add","name":"1.4.1.norm$14","inputs":[[344,0,0],[345,0,0]]},
		{"op":"reshape","name":"1.4.2.linear1$0","attrs":{"shape":"(-3, -2)"},"inputs":[[346,0,0]]},
		{"op":"null","name":"1.4.2.linear1.Net.Weights","inputs":[]},
		{"op":"null","name":"1.4.2.linear1.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.4.2.linear1.Net","attrs":{"num_hidden":"3072","no_bias":"False"},"inputs":[[347,0,0],[348,0,0],[349,0,0]]},
		{"op":"reshape_like","name":"1.4.2.linear1$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[350,0,0],[346,0,0]]},
		{"op":"_PowerScalar","name":"1.4.2.gelu$0","attrs":{"scalar":"3."},"inputs":[[351,0,0]]},
		{"op":"_MulScalar","name":"1.4.2.gelu$1","attrs":{"scalar":"0.044715"},"inputs":[[352,0,0]]},
		{"op":"_Plus","name":"1.4.2.gelu$2","inputs":[[351,0,0],[353,0,0]]},
		{"op":"_MulScalar","name":"1.4.2.gelu$3","attrs":{"scalar":"0.7978845608028654"},"inputs":[[354,0,0]]},
		{"op":"tanh","name":"1.4.2.gelu$4","inputs":[[355,0,0]]},
		{"op":"_PlusScalar","name":"1.4.2.gelu$5","attrs":{"scalar":"1.0"},"inputs":[[356,0,0]]},
		{"op":"_MulScalar","name":"1.4.2.gelu$6","attrs":{"scalar":"0.5"},"inputs":[[351,0,0]]},
		{"op":"_Mul","name":"1.4.2.gelu$7","inputs":[[358,0,0],[357,0,0]]},
		{"op":"reshape","name":"1.4.2.linear2$0","attrs":{"shape":"(-3, -2)"},"inputs":[[359,0,0]]},
		{"op":"null","name":"1.4.2.linear2.Net.Weights","inputs":[]},
		{"op":"null","name":"1.4.2.linear2.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.4.2.linear2.Net","attrs":{"num_hidden":"768","no_bias":"False"},"inputs":[[360,0,0],[361,0,0],[362,0,0]]},
		{"op":"reshape_like","name":"1.4.2.linear2$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[363,0,0],[359,0,0]]},
		{"op":"Dropout","name":"1.4.2.dropout$0","attrs":{"p":"0.1","mode":"always","axes":"()"},"inputs":[[364,0,0]]},
		{"op":"_Plus","name":"1.4.2.add$0","inputs":[[346,0,0],[365,0,0]]},
		{"op":"null","name":"1.4.2.norm.Scaling","inputs":[]},
		{"op":"null","name":"1.4.2.norm.Biases","inputs":[]},
		{"op":"sum_axis","name":"1.4.2.norm$0","attrs":{"axis":"(2)"},"inputs":[[366,0,0]]},
		{"op":"_DivScalar","name":"1.4.2.norm$1","attrs":{"scalar":"768."},"inputs":[[369,0,0]]},
		{"op":"reshape","name":"1.4.2.norm$2","attrs":{"shape":"(0, -1, 1)"},"inputs":[[370,0,0]]},
		{"op":"broadcast_minus","name":"1.4.2.norm$3","inputs":[[366,0,0],[371,0,0]]},
		{"op":"square","name":"1.4.2.norm$4","inputs":[[372,0,0]]},
		{"op":"sum_axis","name":"1.4.2.norm$5","attrs":{"axis":"(2)"},"inputs":[[373,0,0]]},
		{"op":"_DivScalar","name":"1.4.2.norm$6","attrs":{"scalar":"768."},"inputs":[[374,0,0]]},
		{"op":"_PlusScalar","name":"1.4.2.norm$7","attrs":{"scalar":"1.e-12"},"inputs":[[375,0,0]]},
		{"op":"sqrt","name":"1.4.2.norm$8","inputs":[[376,0,0]]},
		{"op":"reshape","name":"1.4.2.norm$9","attrs":{"shape":"(0, -1, 1)"},"inputs":[[377,0,0]]},
		{"op":"broadcast_div","name":"1.4.2.norm$10","inputs":[[372,0,0],[378,0,0]]},
		{"op":"reshape","name":"1.4.2.norm$11","attrs":{"shape":"(1, 1, 768)"},"inputs":[[367,0,0]]},
		{"op":"broadcast_mul","name":"1.4.2.norm$12","inputs":[[379,0,0],[380,0,0]]},
		{"op":"reshape","name":"1.4.2.norm$13","attrs":{"shape":"(1, 1, 768)"},"inputs":[[368,0,0]]},
		{"op":"broadcast_add","name":"1.4.2.norm$14","inputs":[[381,0,0],[382,0,0]]},
		{"op":"reshape","name":"1.5.1.attention.1$0","attrs":{"shape":"(-3, -2)"},"inputs":[[383,0,0]]},
		{"op":"null","name":"1.5.1.attention.1.Net.Weights","inputs":[]},
		{"op":"null","name":"1.5.1.attention.1.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.5.1.attention.1.Net$0","attrs":{"num_hidden":"768"},"inputs":[[384,0,0],[385,0,0],[386,0,0]]},
		{"op":"reshape","name":"1.5.1.attention.1.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[387,0,0]]},
		{"op":"reshape_like","name":"1.5.1.attention.1$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[388,0,0],[383,0,0]]},
		{"op":"null","name":"1.5.1.attention.2.Net.Weights","inputs":[]},
		{"op":"null","name":"1.5.1.attention.2.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.5.1.attention.2.Net$0","attrs":{"num_hidden":"768"},"inputs":[[384,0,0],[390,0,0],[391,0,0]]},
		{"op":"reshape","name":"1.5.1.attention.2.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[392,0,0]]},
		{"op":"reshape_like","name":"1.5.1.attention.2$0","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[393,0,0],[383,0,0]]},
		{"op":"_MulScalar","name":"1.5.1.attention.3$0","attrs":{"scalar":"0.125"},"inputs":[[394,0,0]]},
		{"op":"null","name":"1.5.1.attention.4.Net.Weights","inputs":[]},
		{"op":"null","name":"1.5.1.attention.4.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.5.1.attention.4.Net$0","attrs":{"num_hidden":"768"},"inputs":[[384,0,0],[396,0,0],[397,0,0]]},
		{"op":"reshape","name":"1.5.1.attention.4.Net$1","attrs":{"shape":"(-1, 12, 64)"},"inputs":[[398,0,0]]},
		{"op":"reshape_like","name":"1.5.1.attention.4$0","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[399,0,0],[383,0,0]]},
		{"op":"SwapAxis","name":"1.5.1.attention.5$0","attrs":{"dim1":"1","dim2":"2"},"inputs":[[400,0,0]]},
		{"op":"reshape","name":"1.5.1.attention.5$1","attrs":{"shape":"(-3, -2)"},"inputs":[[401,0,0]]},
		{"op":"SwapAxis","name":"1.5.1.attention.5$2","attrs":{"dim1":"1","dim2":"2"},"inputs":[[389,0,0]]},
		{"op":"reshape","name":"1.5.1.attention.5$3","attrs":{"shape":"(-3, -2)"},"inputs":[[403,0,0]]},
		{"op":"SwapAxis","name":"1.5.1.attention.5$4","attrs":{"dim1":"1","dim2":"2"},"inputs":[[395,0,0]]},
		{"op":"reshape","name":"1.5.1.attention.5$5","attrs":{"shape":"(-3, -2)"},"inputs":[[405,0,0]]},
		{"op":"expand_dims","name":"1.5.1.attention.5$6","attrs":{"axis":"1"},"inputs":[[1,0,0]]},
		{"op":"broadcast_like","name":"1.5.1.attention.5$7","attrs":{"lhs_axes":"(1)","rhs_axes":"(1)"},"inputs":[[407,0,0],[403,0,0]]},
		{"op":"reshape","name":"1.5.1.attention.5$8","attrs":{"shape":"(-1)"},"inputs":[[408,0,0]]},
		{"op":"batch_dot","name":"1.5.1.attention.5$9","attrs":{"transpose_a":"false","transpose_b":"true"},"inputs":[[406,0,0],[404,0,0]]},
		{"op":"SwapAxis","name":"1.5.1.attention.5$10","attrs":{"dim1":"1","dim2":"2"},"inputs":[[410,0,0]]},
		{"op":"SequenceMask","name":"1.5.1.attention.5$11","attrs":{"use_sequence_length":"true","value":"-1e37","axis":"1"},"inputs":[[411,0,0],[409,0,0]]},
		{"op":"SwapAxis","name":"1.5.1.attention.5$12","attrs":{"dim1":"1","dim2":"2"},"inputs":[[412,0,0]]},
		{"op":"softmax","name":"1.5.1.attention.5$13","attrs":{"axis":"-1"},"inputs":[[413,0,0]]},
		{"op":"batch_dot","name":"1.5.1.attention.5$14","attrs":{"transpose_a":"false","transpose_b":"false"},"inputs":[[414,0,0],[402,0,0]]},
		{"op":"reshape_like","name":"1.5.1.attention.5$15","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[415,0,0],[405,0,0]]},
		{"op":"SwapAxis","name":"1.5.1.attention.5$16","attrs":{"dim1":"1","dim2":"2"},"inputs":[[416,0,0]]},
		{"op":"reshape","name":"1.5.1.attention.6$0","attrs":{"shape":"(-3, -2)"},"inputs":[[417,0,0]]},
		{"op":"null","name":"1.5.1.attention.6.Net.Weights","inputs":[]},
		{"op":"null","name":"1.5.1.attention.6.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.5.1.attention.6.Net","attrs":{"num_hidden":"768","no_bias":"False"},"inputs":[[418,0,0],[419,0,0],[420,0,0]]},
		{"op":"reshape_like","name":"1.5.1.attention.6$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[421,0,0],[417,0,0]]},
		{"op":"Dropout","name":"1.5.1.dropout$0","attrs":{"p":"0.1","mode":"always","axes":"()"},"inputs":[[422,0,0]]},
		{"op":"_Plus","name":"1.5.1.add$0","inputs":[[383,0,0],[423,0,0]]},
		{"op":"null","name":"1.5.1.norm.Scaling","inputs":[]},
		{"op":"null","name":"1.5.1.norm.Biases","inputs":[]},
		{"op":"sum_axis","name":"1.5.1.norm$0","attrs":{"axis":"(2)"},"inputs":[[424,0,0]]},
		{"op":"_DivScalar","name":"1.5.1.norm$1","attrs":{"scalar":"768."},"inputs":[[427,0,0]]},
		{"op":"reshape","name":"1.5.1.norm$2","attrs":{"shape":"(0, -1, 1)"},"inputs":[[428,0,0]]},
		{"op":"broadcast_minus","name":"1.5.1.norm$3","inputs":[[424,0,0],[429,0,0]]},
		{"op":"square","name":"1.5.1.norm$4","inputs":[[430,0,0]]},
		{"op":"sum_axis","name":"1.5.1.norm$5","attrs":{"axis":"(2)"},"inputs":[[431,0,0]]},
		{"op":"_DivScalar","name":"1.5.1.norm$6","attrs":{"scalar":"768."},"inputs":[[432,0,0]]},
		{"op":"_PlusScalar","name":"1.5.1.norm$7","attrs":{"scalar":"1.e-12"},"inputs":[[433,0,0]]},
		{"op":"sqrt","name":"1.5.1.norm$8","inputs":[[434,0,0]]},
		{"op":"reshape","name":"1.5.1.norm$9","attrs":{"shape":"(0, -1, 1)"},"inputs":[[435,0,0]]},
		{"op":"broadcast_div","name":"1.5.1.norm$10","inputs":[[430,0,0],[436,0,0]]},
		{"op":"reshape","name":"1.5.1.norm$11","attrs":{"shape":"(1, 1, 768)"},"inputs":[[425,0,0]]},
		{"op":"broadcast_mul","name":"1.5.1.norm$12","inputs":[[437,0,0],[438,0,0]]},
		{"op":"reshape","name":"1.5.1.norm$13","attrs":{"shape":"(1, 1, 768)"},"inputs":[[426,0,0]]},
		{"op":"broadcast_add","name":"1.5.1.norm$14","inputs":[[439,0,0],[440,0,0]]},
		{"op":"reshape","name":"1.5.2.linear1$0","attrs":{"shape":"(-3, -2)"},"inputs":[[441,0,0]]},
		{"op":"null","name":"1.5.2.linear1.Net.Weights","inputs":[]},
		{"op":"null","name":"1.5.2.linear1.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.5.2.linear1.Net","attrs":{"num_hidden":"3072","no_bias":"False"},"inputs":[[442,0,0],[443,0,0],[444,0,0]]},
		{"op":"reshape_like","name":"1.5.2.linear1$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[445,0,0],[441,0,0]]},
		{"op":"_PowerScalar","name":"1.5.2.gelu$0","attrs":{"scalar":"3."},"inputs":[[446,0,0]]},
		{"op":"_MulScalar","name":"1.5.2.gelu$1","attrs":{"scalar":"0.044715"},"inputs":[[447,0,0]]},
		{"op":"_Plus","name":"1.5.2.gelu$2","inputs":[[446,0,0],[448,0,0]]},
		{"op":"_MulScalar","name":"1.5.2.gelu$3","attrs":{"scalar":"0.7978845608028654"},"inputs":[[449,0,0]]},
		{"op":"tanh","name":"1.5.2.gelu$4","inputs":[[450,0,0]]},
		{"op":"_PlusScalar","name":"1.5.2.gelu$5","attrs":{"scalar":"1.0"},"inputs":[[451,0,0]]},
		{"op":"_MulScalar","name":"1.5.2.gelu$6","attrs":{"scalar":"0.5"},"inputs":[[446,0,0]]},
		{"op":"_Mul","name":"1.5.2.gelu$7","inputs":[[453,0,0],[452,0,0]]},
		{"op":"reshape","name":"1.5.2.linear2$0","attrs":{"shape":"(-3, -2)"},"inputs":[[454,0,0]]},
		{"op":"null","name":"1.5.2.linear2.Net.Weights","inputs":[]},
		{"op":"null","name":"1.5.2.linear2.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"1.5.2.linear2.Net","attrs":{"num_hidden":"768","no_bias":"False"},"inputs":[[455,0,0],[456,0,0],[457,0,0]]},
		{"op":"reshape_like","name":"1.5.2.linear2$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[458,0,0],[454,0,0]]},
		{"op":"Dropout","name":"1.5.2.dropout$0","attrs":{"p":"0.1","mode":"always","axes":"()"},"inputs":[[459,0,0]]},
		{"op":"_Plus","name":"1.5.2.add$0","inputs":[[441,0,0],[460,0,0]]},
		{"op":"null","name":"1.5.2.norm.Scaling","inputs":[]},
		{"op":"null","name":"1.5.2.norm.Biases","inputs":[]},
		{"op":"sum_axis","name":"1.5.2.norm$0","attrs":{"axis":"(2)"},"inputs":[[461,0,0]]},
		{"op":"_DivScalar","name":"1.5.2.norm$1","attrs":{"scalar":"768."},"inputs":[[464,0,0]]},
		{"op":"reshape","name":"1.5.2.norm$2","attrs":{"shape":"(0, -1, 1)"},"inputs":[[465,0,0]]},
		{"op":"broadcast_minus","name":"1.5.2.norm$3","inputs":[[461,0,0],[466,0,0]]},
		{"op":"square","name":"1.5.2.norm$4","inputs":[[467,0,0]]},
		{"op":"sum_axis","name":"1.5.2.norm$5","attrs":{"axis":"(2)"},"inputs":[[468,0,0]]},
		{"op":"_DivScalar","name":"1.5.2.norm$6","attrs":{"scalar":"768."},"inputs":[[469,0,0]]},
		{"op":"_PlusScalar","name":"1.5.2.norm$7","attrs":{"scalar":"1.e-12"},"inputs":[[470,0,0]]},
		{"op":"sqrt","name":"1.5.2.norm$8","inputs":[[471,0,0]]},
		{"op":"reshape","name":"1.5.2.norm$9","attrs":{"shape":"(0, -1, 1)"},"inputs":[[472,0,0]]},
		{"op":"broadcast_div","name":"1.5.2.norm$10","inputs":[[467,0,0],[473,0,0]]},
		{"op":"reshape","name":"1.5.2.norm$11","attrs":{"shape":"(1, 1, 768)"},"inputs":[[462,0,0]]},
		{"op":"broadcast_mul","name":"1.5.2.norm$12","inputs":[[474,0,0],[475,0,0]]},
		{"op":"reshape","name":"1.5.2.norm$13","attrs":{"shape":"(1, 1, 768)"},"inputs":[[463,0,0]]},
		{"op":"broadcast_add","name":"1.5.2.norm$14","inputs":[[476,0,0],[477,0,0]]},
		{"op":"relu","name":"2$0","inputs":[[478,0,0]]},
		{"op":"reshape","name":"3$0","attrs":{"shape":"(-3, -2)"},"inputs":[[479,0,0]]},
		{"op":"null","name":"3.Net.Weights","inputs":[]},
		{"op":"null","name":"3.Net.Biases","inputs":[]},
		{"op":"FullyConnected","name":"3.Net","attrs":{"num_hidden":"768","no_bias":"False"},"inputs":[[480,0,0],[481,0,0],[482,0,0]]},
		{"op":"reshape_like","name":"3$1","attrs":{"lhs_begin":"0","lhs_end":"1","rhs_begin":"0","rhs_end":"2"},"inputs":[[483,0,0],[479,0,0]]},
		{"op":"null","name":"Nodes","inputs":[]},
		{"op":"SwapAxis","name":"4$0","attrs":{"dim1":"0","dim2":"1"},"inputs":[[484,0,0]]},
		{"op":"expand_dims","name":"4$1","attrs":{"axis":"0"},"inputs":[[3,0,0]]},
		{"op":"RNN","name":"4$2","attrs":{"state_size":"768","num_layers":"1","mode":"gru","state_outputs":"false"},"inputs":[[486,0,0],[485,0,0],[487,0,0]]},
		{"op":"SequenceLast","name":"4$3","attrs":{"use_sequence_length":"true"},"inputs":[[488,0,0],[1,0,0]]},
		{"op":"BlockGrad","name":"4.State","inputs":[[489,0,0]]},
		{"op":"SwapAxis","name":"5$0","attrs":{"dim1":"0","dim2":"1"},"inputs":[[488,0,0]]},
		{"op":"Dropout","name":"5$1","attrs":{"p":"0.7","mode":"always","axes":"()"},"inputs":[[491,0,0]]},
		{"op":"SequenceMask","name":"6$0","attrs":{"use_sequence_length":"true","value":"0.0","axis":"1"},"inputs":[[492,0,0],[1,0,0]]},
		{"op":"sum_axis","name":"6$1","attrs":{"axis":"(1)"},"inputs":[[493,0,0]]},
		{"op":"reshape","name":"6$2","attrs":{"shape":"(-1, 1)"},"inputs":[[1,0,0]]},
		{"op":"broadcast_div","name":"6$3","inputs":[[494,0,0],[495,0,0]]},
		{"op":"Dropout","name":"7$0","attrs":{"p":"0.6","mode":"always","axes":"()"},"inputs":[[496,0,0]]},
		{"op":"null","name":"8.Weights","inputs":[]},
		{"op":"null","name":"8.Biases","inputs":[]},
		{"op":"FullyConnected","name":"8","attrs":{"num_hidden":"717","no_bias":"False"},"inputs":[[497,0,0],[498,0,0],[499,0,0]]},
		{"op":"Dropout","name":"9$0","attrs":{"p":"0.5","mode":"always","axes":"()"},"inputs":[[500,0,0]]},
		{"op":"null","name":"10.Weights","inputs":[]},
		{"op":"null","name":"10.Biases","inputs":[]},
		{"op":"FullyConnected","name":"10","attrs":{"num_hidden":"717","no_bias":"False"},"inputs":[[501,0,0],[502,0,0],[503,0,0]]},
		{"op":"Dropout","name":"11$0","attrs":{"p":"0.4","mode":"always","axes":"()"},"inputs":[[504,0,0]]},
		{"op":"null","name":"12.Weights","inputs":[]},
		{"op":"null","name":"12.Biases","inputs":[]},
		{"op":"FullyConnected","name":"12","attrs":{"num_hidden":"717","no_bias":"False"},"inputs":[[505,0,0],[506,0,0],[507,0,0]]},
		{"op":"softmax","name":"13$0","attrs":{"axis":"1"},"inputs":[[508,0,0]]},
		{"op":"identity","name":"Output","inputs":[[509,0,0]]}
	],
	"arg_nodes":[0,1,3,5,6,10,11,16,17,39,40,45,46,63,64,76,77,82,83,100,101,105,106,111,112,134,135,140,141,158,159,171,172,177,178,195,196,200,201,206,207,229,230,235,236,253,254,266,267,272,273,290,291,295,296,301,302,324,325,330,331,348,349,361,362,367,368,385,386,390,391,396,397,419,420,425,426,443,444,456,457,462,463,481,482,485,498,499,502,503,506,507],
	"heads":[[510,0,0],[2,0,0],[490,0,0]],
	"attrs":{
		"mxnet_version":["int",10600]
	}
}